package yuwentao.scala.homework.lscj

/**
 * @author yuwentao
 *
 * 2014年6月3日
 * 书面作业包括：
1.课程中的三次随堂练习
2.构造一个函数，其参数是字符串，若字符串长度大于6，返回其字符串的Unicode代码之和；若字符串长度大于4小于6，返回字符串的unicode 代码；若字符串长度短于4，返回字符串的Unicode代码乘积；若字符串长度为0，抛出异常并输出“Warning！”。
3.设置一个不可变映射，包含5个初始的键值，对该映射做以下操作：
  1）根据映射的值对映射进行排序，并输出排序后的映射
  2）在映射中插入两个以上的键值，修改其中两个键值，并输出更新后的映射
4.构造一个函数，其参数是数组，检查数组的所有值，若有相同的值，后者加1


互动作业（本周互动作业在6月2号后才可以进行）
在论坛上探究Scala的数组、映射等使用心得，讨论一些scala在其他包里提供的数组、映射方法的具体使用同效果。
以主题帖形式提出一个问题或话题，并参与不少于5个主题讨论(回帖形式)。
 */
class ScalaDemo4 {

}